<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [165]:
import pandas as pd
import psycopg2

In [166]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [167]:
connection = psycopg2.connect(
    dbname='project_sql',
    user='skillfactory',
    host='84.201.134.129',
    password='cCkxxLVrDE8EbvjueeMedPKt',
    port=5432
)


#DBNAME = 'project_sql'
#USER = 'skillfactory'
#PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
#HOST = '84.201.134.129'
#PORT = 5432

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [168]:
# текст запроса
query_3_1 = f'''select
                     count(id)
                from 
                     vacancies;
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\1699225279.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

In [169]:
# результат запроса
49197

49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [170]:
# текст запроса
query_3_1 = f'''select
                     count(id)
                from 
                     employers;
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\3601892659.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  23501

In [171]:
# результат запроса
23501

23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [172]:
# текст запроса
query_3_1 = f'''select
                     count(id)
                from 
                     areas;
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\785594493.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0   1362

In [173]:
# результат запроса
1362

1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [174]:
# текст запроса
query_3_1 = f'''select
                     count(id)
                from 
                     industries;
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\528409082.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0    294

In [175]:
# результат запроса
294

294

***

In [176]:
# выводы по предварительному анализу данных
База данных содержит следующую информацию:
     - имеются данные о 49 197 вакансиях;
     - количество работодателей составляет 23 501;
     - работодатели расположены в 1 362 регионах;
     - в таблице представлены 294 сферы деятельности.

SyntaxError: invalid syntax (3304277679.py, line 2)

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                     COUNT (v.id) AS cnt,
                     a.name AS area
                from 
                     vacancies AS v JOIN areas AS a ON v.area_id = a.id
                group by a.name
                order by cnt DESC
             '''
df = pd.read_sql_query(query_3_1, connection)
df

In [ ]:
# результат запроса
	cnt	area
0	5333	Москва
1	2851	Санкт-Петербург
2	2112	Минск
3	2006	Новосибирск
4	1892	Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                     COUNT(id)
                     
                from 
                     vacancies
                where salary_from IS NOT NULL OR salary_to IS NOT NULL
                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_10412\917087298.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  24073

In [ ]:
# результат запроса
24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                     ROUND(AVG(salary_from)) AS min_salary,
                     ROUND(AVG(salary_to)) AS max_salary
                     
                from 
                     vacancies
                
                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_21320\2468256273.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   min_salary  max_salary
0     71065.0    110537.0

In [ ]:
# результат запроса
	min_salary	max_salary
0	71065.0 	110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                     schedule,
                     employment,
                     COUNT(*) AS vacancy_count
               
                from 
                     vacancies 
                group by schedule, employment
                order by vacancy_count desc                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_21320\1577777940.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

            schedule           employment  vacancy_count
0        Полный день     Полная занятость          35367
1   Удаленная работа     Полная занятость           7802
2      Гибкий график     Полная занятость           1593
3   Удаленная работа  Частичная занятость           1312
4     Сменный график     Полная занятость            940
5        Полный день           Стажировка            569
6     Вахтовый метод     Полная занятость            367
7        Полный день  Частичная занятость            347
8      Гибкий график  Частичная занятость            312
9        Полный день     Проектная работа            141
10  Удаленная работа     Проектная работа            133
11     Гибкий график           Стажировка            116
12    Сменный график  Частичная занятость            101
13  Удаленная работа           Стажировка             64
14     Гибкий график     Проектная работа             18
15    Сменный график           Стажировка             12
16    Вахтовый метод     Проектная работа              2
17    Сменный график     Проектная работа              1

In [ ]:
# результат запроса
1	Удаленная работа	Полная занятость	7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                     experience,
                     COUNT(*)
                    
                     
                from 
                     vacancies
                
                GROUP BY experience
                HAVING experience IS NOT NULL
                ORDER BY count ASC
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_21320\1179569053.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

In [ ]:
# результат запроса
	experience	count
0	Более 6 лет	1337
1	Нет опыта	7197
2	От 3 до 6 лет	14511
3	От 1 года до 3 лет	26152

***

In [ ]:
# выводы по детальному анализу вакансий
Наибольшее количество вакансий приходится на Москву - 5 333.
В 24 073 вакансиях указано хотя бы одно значение желаемого уровня заработной платы.
Среднее значение желаемой ЗП находится в пределах от 71 065 до 110537.
Наиболее популярным сочетанием рабочего графика и типа трудоустройства является сочетание "Полный день - Полная занятость" - 35 367 вакансий.
Наибольшее количество вакансий (26 152) предъявляют требования к опыту соискателей от 1 до 3х лет.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                     
                     e.name,
                     count(v.id)
                    
                from 
                     vacancies v join employers e ON e.id = v.employer_id
                group by e.name
                order by count(v.id) desc
                limit 5
                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_21320\171545743.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

In [ ]:
# результат запроса
	name	count
0	Яндекс	1933
1	Ростелеком	491
2	Тинькофф	444
3	СБЕР	428
4	Газпром нефть	331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                     
                     a.name area,
                     count (e.id) employers,
                     count (v.id) vacancies
                    
                from areas a
                    left join employers e ON a.id = e.area
                    left join vacancies v ON v.area_id = a.id
                where v.id is null
                group by a.name
                Order by count (e.id) DESC
                
                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

In [ ]:
# результат запроса
	area	employers	vacancies
0	Россия	410	0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                     
                     e.name AS employer,
                     count (DISTINCT v.area_id) cnt_areas
                     
                    
                from employers e
                    join vacancies v ON e.id = v.employer_id
                    
                group by e.name
                Order by count (v.area_id) DESC
                
                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\4287479765.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

                                    employer  cnt_areas
0                                     Яндекс        181
1                                 Ростелеком        152
2                                   Тинькофф         43
3                                       СБЕР         24
4                              Газпром нефть         24
...                                      ...        ...
14761             ПСБ Инновации и Инвестиции          1
14762                             ПСЗ Янтарь          1
14763                                    ПСК          1
14764  Псковский завод механических приводов          1
14765                     ПСК ТатЭнергоСтрой          1

[14766 rows x 2 columns]

In [ ]:
# результат запроса
employer	cnt_areas
0	Яндекс	181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                     
                COUNT(e.name)
 
                from employers AS e LEFT JOIN employers_industries AS ei ON e.id = ei.employer_id
                where industry_id is NULL
                    
                
                
                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\2312137810.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0   8419

In [ ]:
# результат запроса
8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [ ]:
# текст запроса
query_3_1 = f'''select                     
                e.name,     
                ei.employer_id,
                COUNT (ei.industry_id)
                
                from employers_industries AS ei LEFT JOIN employers AS e ON ei.employer_id = e.id
                
                GROUP BY ei.employer_id, e.name
                HAVING COUNT (ei.industry_id) = 4
                ORDER BY e.name
                LiMIT 1
                OFFSET 2    
                
                
                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

In [ ]:
# результат запроса
2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [ ]:
# текст запроса
query_3_1 = f'''select   
                i.name,                  
                COUNT(ei.employer_id)
                                                
                from employers_industries AS ei LEFT JOIN industries AS i ON ei.industry_id = i.id
                WHERE i.name = 'Разработка программного обеспечения'
                GROUP BY i.name
                   
                
                
                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\1734644830.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

                                  name  count
0  Разработка программного обеспечения   3553

In [ ]:
# результат запроса
3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [ ]:
# код для получения списка городов-милионников
import requests 
from bs4 import BeautifulSoup 

url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России' 
response = requests.get(url)
# дальше работа с содержимым страницы
page = BeautifulSoup(response.text, 'html.parser') # Создаём объект BeautifulSoup, указывая html-парсер
data = []
HTML_data = page.find_all("table")[0].find_all("tr")[1:]
for element in HTML_data:
    sub_data = []
    for i,k in enumerate(element):
        try:
            if i == 1:
                sub_data.append(k.get_text())
        except:
            continue
    data.append(sub_data)
data_result = []
for elem in data:
    data_result.extend(elem)
data_result = tuple(data_result)
data_result

In [ ]:
# текст запроса
query_3_1 = f'''WITH temp AS (select   
                a.name,                  
                COUNT(v.id) AS cnt
                                                
               from vacancies v
               left join employers e on v.employer_id = e.id
               left join areas a on a.id = v.area_id
               where e.name = 'Яндекс' AND a.name in {data_result}
               GROUP BY a.name
               ORDER BY COUNT(v.id))
                
               SELECT * FROM temp
               UNION ALL
               SELECT 'Total', SUM(cnt) FROM temp

                
                   
                
                
                
             '''
df = pd.read_sql_query(query_3_1, connection)
df

In [ ]:
# результат запроса

	name	cnt
0	Омск	21.0
1	Челябинск	22.0
2	Красноярск	23.0
3	Волгоград	24.0
4	Пермь	25.0
5	Казань	25.0
6	Ростов-на-Дону	25.0
7	Уфа	26.0
8	Самара	26.0
9	Краснодар	30.0
10	Воронеж	32.0
11	Новосибирск	35.0
12	Нижний Новгород	36.0
13	Екатеринбург	39.0
14	Санкт-Петербург	42.0
15	Москва	54.0
16	Total	485.0

***

In [ ]:
# выводы по анализу работодателей
Компания "Яндекс" находится на первом месте по количеству вакансий (1 933).
Наибольшее число работодателей (410), расположенных в регионе в котором нет вакансий находится в регионе "Россия".
Раблтодателем с наибольшим количеством регионов в которых размещены вакансии является компания "Яндекс" - представлена в 181 регионе.
8 419 работодателей не указывают свою сферу деятельности при размещении вакансий.
1 138 компаний относят себя к 4м сферам деятельности.
Разработка программного обеспечения указана в качестве сферы деятельности у	3 553 компаний.
Компания "Яндекс" разместила 485 вакансий в городах с населением более 1 млн. человек.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [ ]:
# текст запроса

In [ ]:
# результат запроса

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [ ]:
# текст запроса

In [ ]:
# результат запроса

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [ ]:
# текст запроса

In [ ]:
# результат запроса

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

***

In [ ]:
# выводы по предметному анализу

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования